app/Controllers/Ajukan.php

    public function index()
    {
        $user       = new Model_Auth();
        $data = [
            'user'  => $user->find(session()->get('id_users'))
        ];
---
SELECT *
FROM `users`
WHERE `users`.`id_users` = '68'

            ],

        ])) {
            $usulan->save([
                'perihal_ks' => $this->request->getVar('perihal_ks'),
                'awal_ks' => $this->request->getVar('awal_ks'),
                'akhir_ks' => $this->request->getVar('akhir_ks'),
                'bentuk_kegiatan' => $this->request->getVar('bentuk_kegiatan'),
                'unit_p_ks' => $this->request->getVar('unit_p_ks'),
                'deskripsi_ks' => $this->request->getVar('deskripsi_ks'),
                'jenis_dokumen' => $this->request->getVar('jenis_dokumen'),
                'rancangan_ik' => $this->request->getVar('rancangan_ik'),
                'file_input_pk' => $fileName,
                'file_input_dk' => $fileName1,
                'status' => 'verif',
                'id_users' => session()->get('id_users')
            ]);
---
SELECT *
FROM `users`
WHERE `users`.`id_users` = '45'