app/Controllers/Aktif.php

SELECT *
FROM `tb_uks`
WHERE `status` = 'ttd'
AND `akhir_ks` >= '2023-07-16'
---
    public function index()
    {
        $user       = new Model_Auth();
        $tb_uk = new Model_Usulan();

        $data = [
            'user'  => $user->find(session()->get('id_users')),
            'tb_uks' => $tb_uk->where('status', 'ttd')->where('akhir_ks >=', date('Y-m-d'))->findAll(),