app/Controllers/Akun.php

SELECT *
FROM `users`
WHERE `status` = 0
---
    public function index()
    {
        $user       = new Model_Auth();
        $data = [
            'user'  => $user->find(session()->get('id_users')),
            'users' => $user->where('status', 0)->findAll(),