app/Controllers/Dokumen.php

SELECT *
FROM `users`
WHERE `users`.`id_users` = '28'
SELECT *
FROM `tb_uks`
---
    public function index()
    {
        $user       = new Model_Auth();
        $tb_uk = new Model_Usulan();
        $data = [
            'user'  => $user->find(session()->get('id_users')),
            'tb_uks' => $tb_uk->findAll(),
        ];