app/Controllers/ForgotPassword.php

    public function forgotPassword()
    {
        // Logika untuk mengirim email/reset password ke user
        $email = $_POST['email'];
        $userModel = new Model_Auth();
        $user = $userModel->where('email', $email)->first();

        if ($user) {
            $token = $this->generateToken();
            $tokenModel = new Tokens();
            $tokenModel->insert([
                'token' => $token,
                'user_id' => $user['id_users'],
                'created' => date('Y-m-d H:i:s')
            ]);
---
SELECT *
FROM `users`
WHERE `email` = 'dev19web@gmail.com'
 LIMIT 1
INSERT INTO `tokens` (`token`, `user_id`, `created`) VALUES ('9117a999f3e1b98f84cc70b3ee017d20', '28', '2023-06-15 09:31:35')