app/Controllers/Kerjasama.php

SELECT *
FROM `users`
WHERE `users`.`id_users` = '48'
SELECT *
FROM `tb_uks`
WHERE `status` != 'verif'
---
    public function index()
    {
        $user       = new Model_Auth();
        $tb_uk = new Model_Usulan();

        $data = [
            'user'  => $user->find(session()->get('id_users')),
            'tb_uks' => $tb_uk->where('status !=', 'verif')->findAll(),
        ];

UPDATE `tb_uks` SET `status` = 'revisi', `keterangan` = 'revisi admin', `updated_at` = '2023-08-13'
WHERE `id_uk` = '92'
SELECT *
FROM `users`
WHERE `id_users` = '68'
 LIMIT 1
---
    public function update()
    {
        $tb_uk = new Model_Usulan();
        $data = $tb_uk->find($this->request->getVar('id_uk'));
        $data = [
            'status' => 'revisi',
            'keterangan' => $this->request->getVar('keterangan'),
        ];
        $tb_uk->set($data)
            ->where('id_uk', $this->request->getVar('id_uk'))
            ->update();

        $data = $tb_uk->find($this->request->getVar('id_uk'));
        $email = \Config\Services::email();
        $userModel = new Model_Auth();
        $dataUser = $userModel->where('id_users', $data['id_users'])->first();

SELECT *
FROM `tb_uks`
WHERE `tb_uks`.`id_uk` = '87'
---
    public function kerjasamaVerifTolak()
    {
        $tb_uk = new Model_Usulan();

        $data = [
            'tb_uk'  => $tb_uk->find(session()->get('id_uk')),
            'status' => 'tolak',
        ];