app/Controllers/Kerjasama.php

SELECT *
FROM `tb_uks`
WHERE `tb_uks`.`id_uk` = '92'
---
    public function kerjasamaVerifAcc()
    {
        $tb_uk = new Model_Usulan();

        $data = [
            'tb_uk'  => $tb_uk->find(session()->get('id_uk')),
            'status' => 'ttd',
        ];