app/Controllers/Laporan.php

    public function index()
    {
        $user       = new Model_Auth();
        $tb_uk = new Model_Usulan();

        $usulanTerlama = $tb_uk->where('status', 'ttd')->where('akhir_ks <=', date('Y-m-d'))->orderBy('created_at', "ASC")->first();
        $usulanTerbaru = $tb_uk->where('status', 'ttd')->where('akhir_ks <=', date('Y-m-d'))->orderBy('created_at', "DESC")->first();

        if (session()->get('roles') == 'admin') {

            if (!empty($usulanTerlama)) {
                $data = [
                    'usulan_terbaru' => date('Y', strtotime($usulanTerbaru['created_at'])),
                    'usulan_lama' => date('Y', strtotime($usulanTerlama['created_at'])),
                    'user'  => $user->find(session()->get('id_users')),
                    'tb_uks' => $tb_uk->where('status !=', 'verif')->findAll(),
                ];
---
SELECT *
FROM `users`
WHERE `users`.`id_users` = '28'
SELECT *
FROM `tb_uks`
WHERE `status` != 'verif'