app/Controllers/Profile.php

    public function index()
    {
        $user       = new Model_Auth();
        $data = [
            'user'  => $user->find(session()->get('id_users')),
            'users'  => $user->findAll(),
        ];
---
SELECT *
FROM `users`
WHERE `users`.`id_users` = '45'
SELECT *
FROM `users`

    public function update()
    {
        $user = new Model_Auth();
        $data = $user->find($this->request->getVar('id_users'));
---
SELECT *
FROM `users`
WHERE `users`.`id_users` = '45'