app/Controllers/Usulan.php

    public function index()
    {
        $user       = new Model_Auth();
        $tb_uk = new Model_Usulan();

        if (session()->get('roles') == 'admin') {
            $data = [
                'user'  => $user->find(session()->get('id_users')),
                'tb_uks' => $tb_uk->where('status', 'verif')->findAll(),

            ];
            return view('user/usulan_kerjasama', $data);
        } else {
            $data = [
                'user'  => $user->find(session()->get('id_users')),
                'tb_uks' => $tb_uk->where('id_users', session()->get('id_users'))->find(),
                'status' => $tb_uk->where('status', 'proses')->find(),
---
SELECT *
FROM `users`
WHERE `users`.`id_users` = '68'
SELECT *
FROM `tb_uks`
WHERE `id_users` = '68'
SELECT *
FROM `tb_uks`
WHERE `status` = 'proses'